<?php

/*
https://www.php.net/manual/zh/language.operators.errorcontrol.php
错误控制运算符 Error Control Operators
@ at sign
*/

namespace Ext;

class Info extends \Ext\File
{
    const VERSION = 25.0205;
    const REVISION = 1;

    static $args = [
        '__construct' => [
            'options' => [],
            'target' => ['string'],
            'link' => ['string', null],
        ],
        'ini_set' => [
            'option' => 'string',
            'value' => 'string|int|float|bool|null',
        ],
    ];

    static $return = [
        'ini_set' => 'string|false',
    ];

    static $values = [
        'ini_set' => false,
    ];

    /*
    +---------------------------------------------------------------+
    + 异常 断言
    +---------------------------------------------------------------+
    */


    /*
    +---------------------------------------------------------------+
    + 命令行 进程
    +---------------------------------------------------------------+
    */


    /*
    +---------------------------------------------------------------+
    + 扩展
    +---------------------------------------------------------------+
    */


    /*
    +---------------------------------------------------------------+
    + 垃圾回收
    +---------------------------------------------------------------+
    */

/*
    https://www.php.net/manual/zh/features.gc.php
    垃圾回收 Garbage Collection
*/

    function gc_collect_cycles()
    {

    }

    /*
    +---------------------------------------------------------------+
    + 配置 INI
    +---------------------------------------------------------------+
    */

    function ini_set()
    {
        return $this->_call(__FUNCTION__, func_get_args());
    }

    /*
    +---------------------------------------------------------------+
    + 系统 文件
    +---------------------------------------------------------------+
    */

    /*
    +---------------------------------------------------------------+
    + 运行时 常量、变量等
    +---------------------------------------------------------------+
    */

/*
    https://www.php.net/manual/zh/ini.core.php#ini.memory-limit
    资源限制 Resource Limits
    memory_limit = "128M"

*/
    memory_get_peak_usage()

    memory_get_usage()

    memory_reset_peak_usage()

    /*
    +---------------------------------------------------------------+
    + 变量 环境、其它
    +---------------------------------------------------------------+
    */
}
